void main() {
  // Задание 1
  String token = 'латте'; 

  switch (token) {
    case 'экспрессо':
      print('Ваш кофе: экспрессо ☕');
      break;
    case 'американо':
      print('Ваш кофе: американо ☕');
      break;
    case 'капучино':
      print('Ваш кофе: капучино 🥛☕');
      break;
    case 'латте':
      print('Ваш кофе: латте 🥛☕');
      break;
    default:
      print('Ошибка: Жетон не распознан. Автомат возвращает жетон.');
  }
  // Задание 2
  String day = 'суббота';

  if (day == 'суббота' || day == 'воскресенье') {
    print('$day – выходной');
  } else if (day == 'понедельник' || 
             day == 'вторник' || 
             day == 'среда' || 
             day == 'четверг' || 
             day == 'пятница') {
    print('$day – рабочий день');
  } else {
    print('Неизвестный день недели: $day');
  }
}
